namespace glh {
namespace primitives {

GLfloat cube[] = {
  -0.5f,-0.5f,-0.5f, // triángulo 1 : comienza
 -0.5f,-0.5f, 0.5f,
 -0.5f, 0.5f, 0.5f, // triángulo 1 : termina
 0.5f, 0.5f,-0.5f, // triángulo 2 : comienza
 -0.5f,-0.5f,-0.5f,
 -0.5f, 0.5f,-0.5f, // triángulo 2 : termina
 0.5f,-0.5f, 0.5f,
 -0.5f,-0.5f,-0.5f,
 0.5f,-0.5f,-0.5f,
 0.5f, 0.5f,-0.5f,
 0.5f,-0.5f,-0.5f,
 -0.5f,-0.5f,-0.5f,
 -0.5f,-0.5f,-0.5f,
 -0.5f, 0.5f, 0.5f,
 -0.5f, 0.5f,-0.5f,
 0.5f,-0.5f, 0.5f,
 -0.5f,-0.5f, 0.5f,
 -0.5f,-0.5f,-0.5f,
 -0.5f, 0.5f, 0.5f,
 -0.5f,-0.5f, 0.5f,
 0.5f,-0.5f, 0.5f,
 0.5f, 0.5f, 0.5f,
 0.5f,-0.5f,-0.5f,
 0.5f, 0.5f,-0.5f,
 0.5f,-0.5f,-0.5f,
 0.5f, 0.5f, 0.5f,
 0.5f,-0.5f, 0.5f,
 0.5f, 0.5f, 0.5f,
 0.5f, 0.5f,-0.5f,
 -0.5f, 0.5f,-0.5f,
 0.5f, 0.5f, 0.5f,
 -0.5f, 0.5f,-0.5f,
 -0.5f, 0.5f, 0.5f,
 0.5f, 0.5f, 0.5f,
 -0.5f, 0.5f, 0.5f,
 0.5f,-0.5f, 0.5f
};

GLfloat triangle[] = {
  -0.5f, -0.5f, 0.0f,
  0.5f, -0.5f, 0.0f,
  0.0f,  0.5f, 0.0f,
};

};
};
